

greeting = "Вітаю, мене не звуть, я сам приходжу.\n" \
                           "Ви можете задати мені питання з таких тем: " \
                           "математика, фізика, філологія, географія, інформатика, загальні, робота з текстом"

topics = {"мате": "Ви обрали тему \"Математика\".\nЯ можу розв'язати квадратне рівняння,\n"
                  "обчислити відстань між 2 точками,\nвідстань від точки до прямої,\n"
                  "обчислити площу трапеції,\nвивести число пі,\nобчислити довжину дуги кола",
          "фізи": "Ви обрали тему \"Фізика\". Я можу обчислити енергію за законом збереження енергії\n"
                  "обчислити тиск за законом Бойля-Маріотта",
          "філо": "Ви обрали тему \"Філологія\".\nЯ можу пояснити різницю між Present Simple та Present Continuous,\n"
                  "розказати про питальні речення в англійській мові,\n"
                  "вивести список родів іменників в українській мові,\n"
                  "розказати про різницю між Some та Any",
          "геог": "Ви обрали тему \"Географія\". \nЯ знаю: які держави мають найбільшу кількість кордонів,\n"
                  "які держави мають найбільшу кількість водосховищ",
          "зага": "Ви обрали \"Загальні питання\". \nЯ можу сказати який зараз рік,"
                  "\nяка зараз пора року,"
                  "\nпограти у вгадай число між 1 та 10,"
                  "\nсказати надихаючу цитату",
          "текс": "Ви обрали \"Роботу з текстом\". \n"
                  "Я можу знайти складені з латинських літер слова, які у тексті трапляються більше 10 разів, "
                  "\nвивести вміст файлу в зворотному порядку,"
                  "\nперевести текст в верхній регістр,"
                  "\nвивести кількість слів, що містять цифри",
          "інфо": "Ви обрали тему \"Інформатика\". \nЯ можу розказати, що таке інформація, комп'ютер, інтернет, кодування,\n"
                  "алгоритм, блок-схема, програма, система числення",
          "Default": "Такої теми я не знаю"}

quotes = ["Повірте, ви можете, і ви на півдорозі. ",
          "Життя — подорож, а не прибуття до кінцевого пункту призначення. ",
          "Єдиний спосіб робити свою роботу добре — це любити її.",
          "Прагніть не до успіху, а до цінностей, які він дає. ",
          "Кожна невдала спроба – це ще один крок вперед. "]
country = "Китай і росія мають по чотирнадцять сусідніх країн."
tense = "Present Simple вживається на позначення постійного стану чи ситуації, " \
               "повторюваних дій, звичок, очевидних фактів.\n"\
               "Present Continuous вживається на позначення тимчасового стану " \
               "чи ситуації, дій, що відбуваються в момент розмови."
grammar = "Рід – це граматична категорія іменника, яка виражається в трьох значеннях: " \
               "чоловічого, жіночого і середнього роду."
some_any = "Some використовується в розповідних реченнях, а Any – в питальних і заперечних"
question = "Зазвичай питальні речення в англійській мові утворюються зміною порядку слів.\n" \
               "На перше місце ставимо допоміжне дієслово перед підметом, а після підмета - основне дієслово."
reservoir = "Серед країн з найбільшою кількістю водосховищ Канада і Бразилія."
response1 = "Інформація - це сукупність відомостей, які сприймають і видають у навколишнє середовище, зберігають всередині певної системи."
response2 = "Комп'ютери - спеціальні пристрої для зберігання, передачі та обробки інформації"
response3 = "Інтернет – це поєднання багатьох мереж, що забезпечує поширення інформаційних потоків по всій земній кулі"
response4 = "Кодування - це запис інформації за допомогою деякої знакової системи"
response5 = "Алгоритм — набір систематизованих правил виконання обчислювання, що приводить до розв'язання задач після скінченного числа операцій."
response6 = "Блок-схема алгоритму — це графічне зображення алгоритму у вигляді спеціальних блоків зі словесними поясненнями."
response7 = "Програма - це запис алгоритму розв'язання задачі у вигляді послідовності команд або операторів мовою, яку розуміє комп'ютер."
response8 = "Система числення – це спосіб запису чисел за допомогою спеціальних знаків – цифр."


choose_energy = "Виберіть підтему (обчислити Eкін, Епот, Евнутр)"
choose_boyle = "Виберіть підтему (обчислити P1 або V1)"
warn = "Неправильно введені дані або метод"
ask_text = "Введіть назву файлу з текстом"
ask_text2 = "Введіть назву файлу, у який ви бажаєте записати результат"
ask = "Введіть дані (x1, y1, z1, x2, y2, z2)"
ask_num = "Введіть число від 1 до 10"
ask_area = "Введіть дані (a, b, h)"
ask_circle = "Введіть дані (r, θ)"
ask_energy = "Введіть дані (два параметри та const)"
ask_pressure = "Введіть дані (P2, V2, P1/V1)"
ask_line = "Введіть дані ((x1, y1, z1) - координати точки, (x2, y2, z2) та (x3, y3, z3) - координати двох точок на прямій)"
ask_equation = "Введіть коефіцієнти квадратного рівняння"
google = "Тебе в гуглі забанили?"
